from gosla.validation.layouts import english
from gosla.validation.utils import completion_layout_map, gen_alphabet_map, merge_layouts_by_keys, \
    merge_layouts_by_proxy

ALPHABET_MAP = gen_alphabet_map([
    'а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з', 'и', 'й',
    'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф',
    'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я',
])
LOWER_CASE_MAP = {
    'ё': 'Ё', '1': '!', '2': '"', '3': '№', '4': ';', '5': '%',
    '6': ':', '7': '?', '8': '*', '9': '(', '0': ')', '-': '_',
    '=': '+', 'й': 'Й', 'ц': 'Ц', 'у': 'У', 'к': 'К', 'е': 'Е',
    'н': 'Н', 'г': 'Г', 'ш': 'Ш', 'щ': 'Щ', 'з': 'З', 'х': 'Х',
    'ъ': 'Ъ', '\\': '/', 'ф': 'Ф', 'ы': 'Ы', 'в': 'В', 'а': 'А',
    'п': 'П', 'р': 'Р', 'о': 'О', 'л': 'Л', 'д': 'Д', 'ж': 'Ж',
    'э': 'Э', 'я': 'Я', 'ч': 'Ч', 'с': 'С', 'м': 'М', 'и': 'И',
    'т': 'Т', 'ь': 'Ь', 'б': 'Б', 'ю': 'Ю', '.': ',', ' ': ' ',
}
UPPER_CASE_MAP = {value: key for key, value in LOWER_CASE_MAP.items()}
BASE_QWERTY_MAP = {
    'ё': {'1', 'й'},
    '1': {'2', 'ц', 'й', 'ё'},
    '2': {'3', 'у', 'ц', 'й', '1'},
    '3': {'4', 'к', 'у', 'ц', '2'},
    '4': {'5', 'е', 'к', 'у', '3'},
    '5': {'6', 'н', 'е', 'к', '4'},
    '6': {'7', 'г', 'н', 'е', '5'},
    '7': {'8', 'ш', 'г', 'н', '6'},
    '8': {'9', 'щ', 'ш', 'г', '7'},
    '9': {'з', 'щ', 'ш', '8'},
    '0': {'-', 'х', 'з', 'щ', '9'},
    '-': {'=', 'ъ', 'х', 'з', '0'},
    '=': {'\\', 'ъ', 'х', '-'},

    'й': {'1', '2', 'ц', 'ф'},
    'ц': {'2', '3', 'у', 'ы', 'ф', 'й'},
    'у': {'3', '4', 'к', 'в', 'ы', 'ц'},
    'к': {'4', '5', 'е', 'а', 'в', 'у'},
    'е': {'5', '6', 'н', 'п', 'а', 'к'},
    'н': {'6', '7', 'г', 'р', 'п', 'е'},
    'г': {'7', '8', 'ш', 'о', 'р', 'н'},
    'ш': {'8', '9', 'щ', 'л', 'о', 'г'},
    'щ': {'9', '0', 'з', 'д', 'л', 'ш'},
    'з': {'0', '-', 'х', 'ж', 'д', 'щ'},
    'х': {'-', '=', 'ъ', 'э', 'ж', 'з'},
    'ъ': {'=', '\\', 'э', 'х'},
    '\\': {'ъ'},
    'ф': {'й', 'ц', 'ы', 'я'},
    'ы': {'ц', 'у', 'в', 'ч', 'я', 'ф'},
    'в': {'у', 'к', 'а', 'с', 'ч', 'ы'},
    'а': {'к', 'е', 'п', 'м', 'с', 'в'},
    'п': {'е', 'н', 'р', 'и', 'м', 'а'},
    'р': {'н', 'г', 'о', 'т', 'и', 'п'},
    'о': {'г', 'ш', 'л', 'ь', 'т', 'р'},
    'л': {'ш', 'щ', 'д', 'б', 'ь', 'о'},
    'д': {'щ', 'з', 'ж', 'ю', 'б', 'л'},
    'ж': {'з', 'х', 'э', 'ю', 'д'},
    'э': {'х', 'ъ', '.'},

    'я': {'ф', 'ы', 'ч'},
    'ч': {'ы', 'в', 'с', 'я'},
    'с': {'в', 'а', 'м', 'ч'},
    'м': {'а', 'п', 'и', 'с'},
    'и': {'п', 'р', 'т', 'м'},
    'т': {'р', 'о', 'ь', 'и'},
    'ь': {'о', 'л', 'б', 'т'},
    'б': {'л', 'д', 'ю', 'ь'},
    'ю': {'д', 'ж', '.', 'б'},
    '.': {'ж', 'э', 'ю'},
    ' ': {'ч', 'с', 'м', 'и', 'т', 'ь', 'б'},
}

LOWER_QWERTY_RU_EN_MAP = {
    'ё': '`', 'й': 'q', 'ц': 'w', 'у': 'e', 'к': 'r', 'е': 't', 'н': 'y',
    'г': 'u', 'ш': 'i', 'щ': 'o', 'з': 'p', 'х': '[', 'ъ': ']', 'ф': 'a',
    'ы': 's', 'в': 'd', 'а': 'f', 'п': 'g', 'р': 'h', 'о': 'j', 'л': 'k',
    'д': 'l', 'ж': ';', 'э': "'", 'я': 'z', 'ч': 'x', 'с': 'c', 'м': 'v',
    'и': 'b', 'т': 'n', 'ь': 'm', 'б': ',', 'ю': '.',
}

UPPER_QWERTY_RU_EN_MAP = {LOWER_CASE_MAP[key]: english.LOWER_CASE_MAP[value]
                          for key, value in LOWER_QWERTY_RU_EN_MAP.items()}
QWERTY_RU_EN_MAP = {**LOWER_QWERTY_RU_EN_MAP, **UPPER_QWERTY_RU_EN_MAP}

QWERTY_MAP = merge_layouts_by_proxy(
    origin=merge_layouts_by_keys(
        first=english.QWERTY_MAP,
        second=completion_layout_map(
            base_qwerty_map=BASE_QWERTY_MAP,
            lower_case_map=LOWER_CASE_MAP),
    ), proxy=QWERTY_RU_EN_MAP)
